UKS/src/Documents/КомандировочноеУдостоверение/КомандировочноеУдостоверение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КомандировочноеУдостоверение</name>
  <registerRecords>InformationRegister.РегистрКомандировочных</registerRecords>
  <attributes>
    <name>КудаКомандировать</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоКомандировки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеКомандировки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦельКомандировки</name>
    <type>
      <types>CatalogRef.ЦелиКомандировки</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыдалЗадание</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Составитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоСлужебнойКомандировки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеПоКомандировке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>800</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ГруппаРаботников</name>
    <attributes>
      <name>ФИОполное</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UKS/src/Catalogs/Подразделения/Подразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Подразделения</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <comment>Руководитель</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРуководителя</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Кабинеты</name>
    <attributes>
      <name>НомерКабинета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнутреннийНомер</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UKS/src/Documents/КомандировочноеУдостоверение/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ПечататьВПриказ(Команда)
	ПараметрыПолей = ПараметрыПолейНаСервереВПриказ();
	
	Результат = УправлениеПечатьюСервер.ПечататьКомандировкуВПриказ(ПараметрыПолей);
	УправлениеПечатьюКлиентСервер.ДокументПоказать(Результат,3);
КонецПроцедуры

&НаСервере 
Функция  ПараметрыПолейНаСервереВПриказ()
	ПарметрыПолей = Новый Структура;
	
	Командир = Элементы.Список.ВыделенныеСтроки;
	Для Каждого Стр Из Командир Цикл
		СсылкаНаКоманди = Стр;
	КонецЦикла;
	ГрупРаб = СсылкаНаКоманди.ГруппаРаботников;
	КолГруп = ГрупРаб.Количество();
	Для Каждого СотГруп Из ГрупРаб Цикл
		парам = "" + СотГруп.ФИОполное.Должность + " " + СотГруп.ФИОполное.Наименование + ", "; 
		СтрокаСотрудник = "" + СтрокаСотрудник + СтрСоединить(ПолучитьСклоненияСтроки( парам,,"ПД=Винительный")," ");
	КонецЦикла;
	сооб = "" + СсылкаНаКоманди.КудаКомандировать;
	СтрокаПриказКаманд = СтрокаСотрудник;
	ПарметрыПолей.Вставить("МЕСТИОРГ", сооб);
	
	
	ТекстДляВорд = СсылкаНаКоманди.ЦельКомандировки.Наименование;
	
	КоличествоСимволов = 48;		
	НомерПервогоСимволаСтрокиПоиска = 70;
	НомерПервогоСимволаСтроки = 0;
	ДлинаВсейСтр = СтрДлина(ТекстДляВорд);

	Для К = 0 По 8 Цикл
		ТекстДляВордРед = Сред(ТекстДляВорд, НомерПервогоСимволаСтроки, КоличествоСимволов);
		Кол = СтрДлина(ТекстДляВордРед);
		Если Кол = КоличествоСимволов Тогда
			КоличествоСимволовВСтроке = СтрНайти(ТекстДляВордРед, " ", НаправлениеПоиска.СКонца, Кол);
		Иначе
			КоличествоСимволовВСтроке = 70;
		КонецЕсли;
		Если Кол < КоличествоСимволов И Не КоличествоСимволовВСтроке = 0 Тогда 
			
			ТекстВставки = ТекстДляВордРед;
			
		Иначе
			
			ТекстВставки = Сред(ТекстДляВордРед, 0, КоличествоСимволовВСтроке);
			
		КонецЕсли;
		
		ПарметрыПолей.Вставить("ЦЕЛЬ" + К, ТекстВставки);
		
		НомерПервогоСимволаСтрокиПоиска = КоличествоСимволовВСтроке + НомерПервогоСимволаСтрокиПоиска;

		НомерПервогоСимволаСтроки = НомерПервогоСимволаСтроки + КоличествоСимволовВСтроке;
		КоличествоСимволов = 70;
 	КонецЦикла;

	
	
	ПарметрыПолей.Вставить("НАЧАЛКОМА", СсылкаНаКоманди.НачалоКомандировки);
	ПарметрыПолей.Вставить("ОКОНКОМА", СсылкаНаКоманди.ОкончаниеКомандировки);
	ПарметрыПолей.Вставить("ДНЕЙКОМА", СсылкаНаКоманди.КоличествоДней);
	ПарметрыПолей.Вставить("ДОЛЖНОСТЬНАЧАЛЬНИ", СсылкаНаКоманди.ВыдалЗадание.Должность.Наименование);
	ПарметрыПолей.Вставить("ФИОНАЧАЛЬНИ", СсылкаНаКоманди.ВыдалЗадание.Наименование);
	
	ТекстДляВорд = СтрокаПриказКаманд;

	КоличествоСимволов = 55;		
	НомерПервогоСимволаСтрокиПоиска = 70;
	НомерПервогоСимволаСтроки = 0;
	ДлинаВсейСтр = СтрДлина(ТекстДляВорд);

	Для К = 0 По 8 Цикл
		ТекстДляВордРед = Сред(ТекстДляВорд, НомерПервогоСимволаСтроки, КоличествоСимволов);
		Кол = СтрДлина(ТекстДляВордРед);
		Если Кол = КоличествоСимволов Тогда
			КоличествоСимволовВСтроке = СтрНайти(ТекстДляВордРед, " ", НаправлениеПоиска.СКонца, Кол);
		Иначе
			КоличествоСимволовВСтроке = 70;
		КонецЕсли;
		Если Кол < КоличествоСимволов И Не КоличествоСимволовВСтроке = 0 Тогда 
			
			ТекстВставки = ТекстДляВордРед;
			
		Иначе
			
			ТекстВставки = Сред(ТекстДляВордРед, 0, КоличествоСимволовВСтроке);
			
		КонецЕсли;
		
		ПарметрыПолей.Вставить("ГРУППАКОМАН" + К, ТекстВставки);
		
		НомерПервогоСимволаСтрокиПоиска = КоличествоСимволовВСтроке + НомерПервогоСимволаСтрокиПоиска;
		
		НомерПервогоСимволаСтроки = НомерПервогоСимволаСтроки + КоличествоСимволовВСтроке;
		КоличествоСимволов = 70;
	КонецЦикла;
	

	МассивДней = ПолучитьСклоненияСтрокиПоЧислу("день", СсылкаНаКоманди.КоличествоДней,,,"ПД=Именительный");
	Пробел = Найти(МассивДней[0]," ");
	Если Пробел > 0 Тогда
		ИскомаяСтрока = Сред(МассивДней[0],Пробел + 1);
	Иначе
		ИскомаяСтрока = МассивДней[0];
	КонецЕсли;
	ПарметрыПолей.Вставить("ДНЕЙТЕК",ИскомаяСтрока);
	
	Возврат ПарметрыПолей;

КонецФункции

&НаКлиенте
Процедура Обнова()
	ОтборПоДате();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
         
	ПодключитьОбработчикОжидания("Обнова", 30, Ложь); 
	
КонецПроцедуры

&НаСервере
Функция ПечатьКомандировочнойНаСервере()
	НуднаяКомандировка = Элементы.Список.ВыделенныеСтроки;
	Для Каждого СтрКом Из НуднаяКомандировка Цикл
		СсылкаКоманди = СтрКом;
	КонецЦикла;
	Проверка = Ложь;
	Если СсылкаКоманди.ГруппаРаботников.Количество() = 1 Тогда
		Проверка = Истина;
	КонецЕсли;
	
	Возврат Проверка;
	
КонецФункции

&НаСервере 
Функция  ПараметрыПолейНаСервере()
	
	НуднаяКомандировка = Элементы.Список.ВыделенныеСтроки;
	Для Каждого СтрКом Из НуднаяКомандировка Цикл
		СсылкаКоманди = СтрКом;
	КонецЦикла;

	
	ПарметрыПолей = Новый Структура;
	ПарметрыПолей.Вставить("номер", СсылкаКоманди.Номер);
	ПарметрыПолей.Вставить("дата", Формат(СсылкаКоманди.Дата, "ДФ=dd.MM.yyyy"));
	ПарметрыПолей.Вставить("КудаКомандировать", СсылкаКоманди.КудаКомандировать);
	ПарметрыПолей.Вставить("НачалоКомандировки", СсылкаКоманди.НачалоКомандировки);
	ПарметрыПолей.Вставить("ОкончаниеКомандировки", СсылкаКоманди.ОкончаниеКомандировки);
	
	ПарметрыПолей.Вставить("НомерПриказа", СсылкаКоманди.НомерПриказа);
	Если СсылкаКоманди.ДатаПриказа = Дата(1,1,1,0,0,0) Тогда
		ПарметрыПолей.Вставить("ДатаПриказа", "          ");
	Иначе
	ПарметрыПолей.Вставить("ДатаПриказа", СсылкаКоманди.ДатаПриказа);
	КонецЕсли;

	
	
	ПарметрыПолей.Вставить("Подразделение", СсылкаКоманди.Подразделение.Наименование);
	ПарметрыПолей.Вставить("Руководитель", СсылкаКоманди.Руководитель.Наименование);
	ПарметрыПолей.Вставить("РуководительДолжность", СсылкаКоманди.Руководитель.Должность.Наименование);
	ПарметрыПолей.Вставить("КоДн", СсылкаКоманди.КоличествоДней);
	
	МассивДней = ПолучитьСклоненияСтрокиПоЧислу("день", СсылкаКоманди.КоличествоДней,,,"ПД=Именительный");
	Пробел = Найти(МассивДней[0]," ");
	Если Пробел > 0 Тогда
		ИскомаяСтрока = Сред(МассивДней[0],Пробел + 1);
	Иначе
		ИскомаяСтрока = МассивДней[0];
	КонецЕсли;
	ПарметрыПолей.Вставить("День", ИскомаяСтрока);
	
	Строка = СтрДлина(СсылкаКоманди.ЦельКомандировки.ПолноеНаименование);
	ПробелФ = СтрНайти(СсылкаКоманди.ЦельКомандировки.ПолноеНаименование," ",НаправлениеПоиска.СКонца);
	
	
	ПарметрыПолей.Вставить("Составитель", СсылкаКоманди.Составитель.Наименование);
	ПарметрыПолей.Вставить("Составитель0", СсылкаКоманди.Составитель.Наименование);
	ПарметрыПолей.Вставить("СоставительДолжность", СсылкаКоманди.Составитель.Должность.Наименование);
	

	ТекстДляВорд = СсылкаКоманди.ЦельКомандировки.ПолноеНаименование;
	
	КоличествоСимволов = 95;		
	НомерПервогоСимволаСтрокиПоиска = 95;
	НомерПервогоСимволаСтроки = 0;
	ДлинаВсейСтр = СтрДлина(ТекстДляВорд);

	Для К = 0 По 8 Цикл
	    ТекстДляВордРед = Сред(ТекстДляВорд, НомерПервогоСимволаСтроки, КоличествоСимволов);
		Кол = СтрДлина(ТекстДляВордРед);
		Если Кол > 95 Тогда
		КоличествоСимволовВСтроке = СтрНайти(ТекстДляВордРед, " ", НаправлениеПоиска.СКонца, Кол);
	Иначе
		КоличествоСимволовВСтроке = 95;
		КонецЕсли;
		Если Кол < КоличествоСимволов И Не КоличествоСимволовВСтроке = 0 Тогда 
			
			ТекстВставки = ТекстДляВордРед;
			
		Иначе
			
			ТекстВставки = Сред(ТекстДляВордРед, 0, КоличествоСимволовВСтроке);
			
		КонецЕсли;
		
		ПарметрыПолей.Вставить("ЦельКомандировки1" + К, ТекстВставки);
		
		НомерПервогоСимволаСтрокиПоиска = КоличествоСимволовВСтроке + НомерПервогоСимволаСтрокиПоиска;

		НомерПервогоСимволаСтроки = НомерПервогоСимволаСтроки + КоличествоСимволовВСтроке;
		
 	КонецЦикла;

	
	ПарметрыПолей.Вставить("ВыдалЗадание", СсылкаКоманди.ВыдалЗадание.Наименование);
	ПарметрыПолей.Вставить("ВыдалЗаданиеДолжность", СсылкаКоманди.ВыдалЗадание.Должность.Наименование);
	
ТекстДляВорд = СсылкаКоманди.ЦельКомандировки;
	
	КоличествоСимволов = 95;		
	НомерПервогоСимволаСтрокиПоиска = 95;
	НомерПервогоСимволаСтроки = 0;
	ДлинаВсейСтр = СтрДлина(ТекстДляВорд);

	Для К = 0 По 8 Цикл
	    ТекстДляВордРед = Сред(ТекстДляВорд, НомерПервогоСимволаСтроки, КоличествоСимволов);
		Кол = СтрДлина(ТекстДляВордРед);
		Если Кол = 95 Тогда
		КоличествоСимволовВСтроке = СтрНайти(ТекстДляВордРед, " ", НаправлениеПоиска.СКонца, Кол);
		Иначе
		КоличествоСимволовВСтроке = 95;
		КонецЕсли;
		Если Кол < КоличествоСимволов И Не КоличествоСимволовВСтроке = 0 Тогда 
			
			ТекстВставки = ТекстДляВордРед;
			
		Иначе
			
			ТекстВставки = Сред(ТекстДляВордРед, 0, КоличествоСимволовВСтроке);
			
		КонецЕсли;
		
		ПарметрыПолей.Вставить("ЦельКомандировки" + К, ТекстВставки);
		
		НомерПервогоСимволаСтрокиПоиска = КоличествоСимволовВСтроке + НомерПервогоСимволаСтрокиПоиска;

		НомерПервогоСимволаСтроки = НомерПервогоСимволаСтроки + КоличествоСимволовВСтроке;
		
 	КонецЦикла;

	
	ПарметрыПолей.Вставить("Д", Формат(СсылкаКоманди.НачалоКомандировки,"ДФ=дд"));
	ПарметрыПолей.Вставить("М", Сред(Формат(СсылкаКоманди.НачалоКомандировки,"ДФ=ддММММ"), 3));
	ПарметрыПолей.Вставить("Г", Формат(СсылкаКоманди.НачалоКомандировки,"ДФ=гггг"));	
	
	Возврат ПарметрыПолей;
КонецФункции

&НаСервере
Функция ПараметрыТаблицНаСервере()
	
	НуднаяКомандировка = Элементы.Список.ВыделенныеСтроки;
	Для Каждого СтрКом Из НуднаяКомандировка Цикл
		СсылкаКоманди = СтрКом;
	КонецЦикла;
	
	ПараметрыТаблиц = Новый Структура();
	ПараметрыТаблиц.Вставить("ГруппаРаботников",ПоместитьВоВременноеХранилище(СсылкаКоманди.ГруппаРаботников.Выгрузить(),ЭтаФорма.УникальныйИдентификатор));
	
	Возврат ПараметрыТаблиц;
КонецФункции

&НаКлиенте
Процедура ПечатьКомандировочной(Команда)
	
	Если ПечатьКомандировочнойНаСервере() Тогда
			
			ПараметрыПолей = ПараметрыПолейНаСервере(); 
			Результат = УправлениеПечатьюСервер.ПечататьКомандировкуСоло(ПараметрыПолей);
			УправлениеПечатьюКлиентСервер.ДокументПоказать(Результат,3);
		Иначе 
			
			ПараметрыПолей = ПараметрыПолейНаСервере();
			ПараметрыТаблиц = ПараметрыТаблицНаСервере();
			
			Результат = УправлениеПечатьюСервер.ПечататьКомандировку(ПараметрыПолей, ПараметрыТаблиц);
			УправлениеПечатьюКлиентСервер.ДокументПоказать(Результат,3);
			
		КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДатаОтбораПриИзмененииНаСервере()
	ОтборПоДате();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтбораПриИзменении(Элемент)
	ДатаОтбораПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоДатеНаКлиенте()
	ОтборПоДате();
КонецПроцедуры

&НаСервере
Процедура ОтборПоДате()   
	Если Не ЗначениеЗаполнено(ДатаОтбора.ДатаНачала) Тогда
		ОбщегоНазначенияНаСервере.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список,"Дата",);		
	Иначе
		МассивДат = Новый Массив;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомандировочноеУдостоверение.Дата КАК Дата
		|ИЗ
		|	Документ.КомандировочноеУдостоверение КАК КомандировочноеУдостоверение
		|ГДЕ
		|	КомандировочноеУдостоверение.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
		
		Запрос.УстановитьПараметр("ДатаНачала", ДатаОтбора.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОтбора.ДатаОкончания); 		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи2 = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи2.Следующий() Цикл
			МассивДат.Добавить(ВыборкаДетальныеЗаписи2.Дата);
		КонецЦикла;
		
		
		ОбщегоНазначенияНаСервере.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список,"Дата",);				
		ОбщегоНазначенияНаСервере.УстановитьЭлементОтбораДинамическогоСписка(Список,"Дата",МассивДат,,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный,);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПриИзмененииНаСервере()
	Если Подразделение = Справочники.Подразделения.ПустаяСсылка() Тогда
		ОбщегоНазначенияНаСервере.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список,"Подразделение",);
	Иначе	
		ОбщегоНазначенияНаСервере.УстановитьЭлементОтбораДинамическогоСписка(Список,"Подразделение", Подразделение, ВидСравненияКомпоновкиДанных.Равно,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный,);
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Подразделение", "ОтборПоПодразделению");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ПодразделениеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НетПриказаПриИзмененииНаСервере()
	Если НетПриказа = Ложь Тогда
		ОбщегоНазначенияНаСервере.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список,"НомерПриказа",);
	ИначеЕсли НетПриказа = Истина Тогда	
		ОбщегоНазначенияНаСервере.УстановитьЭлементОтбораДинамическогоСписка(Список,"НомерПриказа", "", ВидСравненияКомпоновкиДанных.Равно,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный,);
	КонецЕсли;КонецПроцедуры

&НаКлиенте
Процедура НетПриказаПриИзменении(Элемент)
	НетПриказаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КлиентПользователя = "";
	ПолучитьКлиентПользователя(КлиентПользователя);
	
	Если КлиентПользователя = "Веб-клиент" Тогда
		Элементы.Печать.Видимость = Ложь;	
	Иначе
		Элементы.ПечатьНаВебКлиенте.Видимость = Ложь;
	КонецЕсли; 

	
	ДатаОтбора.ДатаНачала = НачалоМесяца(ТекущаяДата());
	ДатаОтбора.ДатаОкончания = КонецМесяца(ТекущаяДата());
	ОтборПоДате();
	Если Не ПараметрыСеанса.ТекущийПользователь.Подразделение = Справочники.Подразделения.ПустаяСсылка() И Не РольДоступна("Администратор") И Не РольДоступна("Командировка")  Тогда
		Подразделение = ПараметрыСеанса.ТекущийПользователь.Подразделение;
	КонецЕсли;
	
	ПодразделениеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	ОтборПоДате();
КонецПроцедуры

&НаКлиенте
Процедура ПечататьВПриказВВеб(Команда)
	ТаблДок = ПечатьКомандировкиВПриказНаСервере();
	ТаблДок.ОтображатьСетку = Ложь;
	ТаблДок.АвтоМасштаб = Истина;
	ТаблДок.ТолькоПросмотр = Истина;
	ТаблДок.МасштабПечати = 100;
	ТаблДок.ПолеСлева=15;
	ТаблДок.ОтображатьЗаголовки = Ложь; 
	ТаблДок.Показать("В Приказ");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьКомандировочногоЛистаВВеб(Команда)
	НазваниеДокумента = "Командировочное удостоверение и Авансовый отчет";
	
	Если ПечатьКомандировочнойНаСервере() Тогда
		ТаблДок = ПечатьКомандировкиДляОдногоНаСервере();
	Иначе
		ТаблДок = ПечатьКомандировкиНаСервере();
	КонецЕсли;
	ТаблДок.ОтображатьСетку = Ложь;
	//ТаблДок.Защита = Истина;
	ТаблДок.АвтоМасштаб = Истина;
	ТаблДок.ТолькоПросмотр = Истина;
	ТаблДок.ОтображатьЗаголовки = Ложь;
	ТаблДок.АвтоМасштаб=ложь; 	
	ТаблДок.МасштабПечати = 100;
	ТаблДок.ПолеСлева=15;
	ТаблДок.Показать(НазваниеДокумента);
КонецПроцедуры

&НаСервере
Функция ПечатьКомандировкиНаСервере()
	НуднаяКомандировка = Элементы.Список.ВыделенныеСтроки;
	Для Каждого СтрКом Из НуднаяКомандировка Цикл
		СсылкаКоманди = СтрКом;
	КонецЦикла;
	
	ТаблДок = Новый ТабличныйДокумент;
	Макет = Документы.КомандировочноеУдостоверение.ПолучитьМакет("КомандировочноеУдостоверениеИКоллективныйАвансовыйОтчет");
	ПервыйЛист1 = Макет.ПолучитьОбласть("Лист11");
	ПервыйЛист2 = Макет.ПолучитьОбласть("Лист12");

	ТаблСотр = Макет.ПолучитьОбласть("ТаблСотруд");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомандировочноеУдостоверение.Ссылка КАК Ссылка,
		|	КомандировочноеУдостоверение.Номер КАК Номер,
		|	КомандировочноеУдостоверение.Дата КАК Дата,
		|	КомандировочноеУдостоверение.КудаКомандировать КАК КудаКомандировать,
		|	КомандировочноеУдостоверение.НачалоКомандировки КАК НачалоКомандировки,
		|	КомандировочноеУдостоверение.ОкончаниеКомандировки КАК ОкончаниеКомандировки,
		|	КомандировочноеУдостоверение.ЦельКомандировки КАК ЦельКомандировки,
		|	КомандировочноеУдостоверение.Подразделение КАК Подразделение,
		|	КомандировочноеУдостоверение.ВыдалЗадание КАК ВыдалЗадание,
		|	КомандировочноеУдостоверение.Составитель КАК Составитель,
		|	КомандировочноеУдостоверение.КоличествоДней КАК КоличествоДней,
		|	КомандировочноеУдостоверение.Руководитель КАК Руководитель,
		|	КомандировочноеУдостоверение.НомерПриказа КАК НомерПриказа,
		|	КомандировочноеУдостоверение.ДатаПриказа КАК ДатаПриказа
		|ИЗ
		|	Документ.КомандировочноеУдостоверение КАК КомандировочноеУдостоверение
		|ГДЕ
		|	КомандировочноеУдостоверение.Ссылка = &Ссылка";
	    Запрос.УстановитьПараметр("Ссылка", СсылкаКоманди);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	КомандИнфо = ВыборкаДетальныеЗаписи;
	КонецЕсли;
	
	ПервыйЛист1.Параметры.Номер = КомандИнфо.Номер;
	ПервыйЛист1.Параметры.Дата = Формат(КомандИнфо.Дата,"ДФ=dd.MM.yyyy");
	ПервыйЛист1.Параметры.Подразделение = КомандИнфо.Подразделение;
	ТаблДок.Вывести(ПервыйЛист1);
	
	Шапка1 = Макет.ПолучитьОбласть("ШапкаСотрудникПервыйЛист");

	Шапка1.Область("ШапкаСотрудникПервыйЛист").ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	
	ТаблДок.Вывести(Шапка1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомандировочноеУдостоверениеГруппаРаботников.НомерСтроки КАК НомерСтроки,
		|	КомандировочноеУдостоверениеГруппаРаботников.ФИОполное КАК ФИОполное,
		|	КомандировочноеУдостоверениеГруппаРаботников.Примечание КАК Примечание
		|ИЗ
		|	Документ.КомандировочноеУдостоверение.ГруппаРаботников КАК КомандировочноеУдостоверениеГруппаРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КомандировочноеУдостоверение КАК КомандировочноеУдостоверение
		|		ПО КомандировочноеУдостоверениеГруппаРаботников.Ссылка = КомандировочноеУдостоверение.Ссылка
		|ГДЕ
		|	КомандировочноеУдостоверение.Ссылка = &Ссылка";
	      Запрос.УстановитьПараметр("Ссылка", СсылкаКоманди);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КоличествоСтрок = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТаблСотр.Параметры.Ном = ВыборкаДетальныеЗаписи.НомерСтроки;
		ТаблСотр.Параметры.ФИОПолн = ВыборкаДетальныеЗаписи.ФИОполное.ПолноеНаименование;
		ТаблСотр.Параметры.Долж = ВыборкаДетальныеЗаписи.ФИОполное.Должность;
		ТаблСотр.Параметры.Примич = ВыборкаДетальныеЗаписи.Примечание;
		ТаблДок.Вывести(ТаблСотр);
		КоличествоСтрок = КоличествоСтрок + 1;
	КонецЦикла;
	
	Пока КоличествоСтрок <10 Цикл 
		ТаблСотр.Параметры.Ном = "";
		ТаблСотр.Параметры.ФИОПолн = "";
		ТаблСотр.Параметры.Долж = "";
		ТаблСотр.Параметры.Примич = "";
		ТаблДок.Вывести(ТаблСотр);
		КоличествоСтрок = КоличествоСтрок + 1;		
	КонецЦикла;

	
	ПервыйЛист2.Параметры.КудаКомандировать = КомандИнфо.КудаКомандировать;
	ПервыйЛист2.Параметры.День = ПолучитьСклоненияСтрокиПоЧислу("день", КомандИнфо.КоличествоДней,,,"ПД=Именительный")[0];
	ПервыйЛист2.Параметры.НачалоКомандировки = Формат(КомандИнфо.НачалоКомандировки,"ДЛФ=DD");
	ПервыйЛист2.Параметры.ОкончаниеКомандировки = Формат(КомандИнфо.ОкончаниеКомандировки,"ДЛФ=DD");
	ПервыйЛист2.Параметры.ЦельКомандировки01 = Врег(Лев(КомандИнфо.ЦельКомандировки.ПолноеНаименование,1)) + Сред(КомандИнфо.ЦельКомандировки.ПолноеНаименование,2);
	ПервыйЛист2.Параметры.НомерПриказа = КомандИнфо.НомерПриказа;
	ПервыйЛист2.Параметры.ДатаПриказа = Формат(КомандИнфо.ДатаПриказа,"ДФ=dd.MM.yyyy");
	ПервыйЛист2.Параметры.РуководительДолжность = КомандИнфо.Руководитель.Должность;
	ПервыйЛист2.Параметры.Руководитель = КомандИнфо.Руководитель;
	ПервыйЛист2.Параметры.Д = Формат(КомандИнфо.НачалоКомандировки,"ДФ=дд");
	ПервыйЛист2.Параметры.М = Сред(Формат(КомандИнфо.НачалоКомандировки,"ДФ=ддММММ"), 3);
	ПервыйЛист2.Параметры.Г = Формат(КомандИнфо.НачалоКомандировки,"ДФ=гггг");
	ТаблДок.Вывести(ПервыйЛист2);

	ТаблДок.ВывестиГоризонтальныйРазделительСтраниц();

	
	ВторойЛист1 = Макет.ПолучитьОбласть("Лист21");
	ВторойЛист2 = Макет.ПолучитьОбласть("Лист22");
	ШапкаТаб2 = Макет.ПолучитьОбласть("ШапкаТаблСотруд1");
	ТаблСотр2 = Макет.ПолучитьОбласть("ФИОПолнСотр");
	ПодвалТабл = Макет.ПолучитьОбласть("ПодвалСотр");
	
	ТаблДок.Вывести(ВторойЛист1);
	ТаблДок.Вывести(ШапкаТаб2);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомандировочноеУдостоверениеГруппаРаботников.НомерСтроки КАК НомерСтроки,
		|	КомандировочноеУдостоверениеГруппаРаботников.ФИОполное КАК ФИОполное
		|ИЗ
		|	Документ.КомандировочноеУдостоверение.ГруппаРаботников КАК КомандировочноеУдостоверениеГруппаРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КомандировочноеУдостоверение КАК КомандировочноеУдостоверение
		|		ПО КомандировочноеУдостоверениеГруппаРаботников.Ссылка = КомандировочноеУдостоверение.Ссылка
		|ГДЕ
		|	КомандировочноеУдостоверение.Ссылка = &Ссылка";
	      Запрос.УстановитьПараметр("Ссылка", СсылкаКоманди);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТаблСотр2.Параметры.Номер = ВыборкаДетальныеЗаписи.НомерСтроки;
		ТаблСотр2.Параметры.ФИОПолн = ВыборкаДетальныеЗаписи.ФИОполное.Наименование; 	
		ТаблДок.Вывести(ТаблСотр2);
	КонецЦикла;
	ТаблДок.Вывести(ПодвалТабл);

	ВторойЛист2.Параметры.СоставительДолжность = КомандИнфо.Составитель.Должность;
	ВторойЛист2.Параметры.Составитель = КомандИнфо.Составитель.Наименование;
	
	ТекстДляВорд = Врег(Лев(КомандИнфо.ЦельКомандировки.ПолноеНаименование,1)) + Сред(КомандИнфо.ЦельКомандировки.ПолноеНаименование,2);
	
	КоличествоСимволов = 105;		
	НомерПервогоСимволаСтрокиПоиска = 105;
	НомерПервогоСимволаСтроки = 0;
	ДлинаВсейСтр = СтрДлина(ТекстДляВорд);

	Для К = 0 По 8 Цикл
	    ТекстДляВордРед = Сред(ТекстДляВорд, НомерПервогоСимволаСтроки, КоличествоСимволов);
		Кол = СтрДлина(ТекстДляВордРед);
		Если Кол = 105 Тогда
		КоличествоСимволовВСтроке = СтрНайти(ТекстДляВордРед, " ", НаправлениеПоиска.СКонца, Кол);
		Иначе
		КоличествоСимволовВСтроке = 105;
		КонецЕсли;
		Если Кол < КоличествоСимволов И Не КоличествоСимволовВСтроке = 0 Тогда 
			
			ТекстВставки = ТекстДляВордРед;
			
		Иначе
			
			ТекстВставки = Сред(ТекстДляВордРед, 0, КоличествоСимволовВСтроке);
			
		КонецЕсли;
		Если К = 0 Тогда
			ВторойЛист2.Параметры.ЦельКомандировки0 = ТекстВставки;
		ИначеЕсли К = 1 Тогда
			ВторойЛист2.Параметры.ЦельКомандировки1 = ТекстВставки;
		ИначеЕсли К = 2 Тогда
			ВторойЛист2.Параметры.ЦельКомандировки2 = ТекстВставки;
		ИначеЕсли К = 3 Тогда
			ВторойЛист2.Параметры.ЦельКомандировки3 = ТекстВставки;
		ИначеЕсли К = 4 Тогда
			ВторойЛист2.Параметры.ЦельКомандировки4 = ТекстВставки;			
		ИначеЕсли К = 5 Тогда
			ВторойЛист2.Параметры.ЦельКомандировки5 = ТекстВставки;			
		ИначеЕсли К = 6 Тогда
			ВторойЛист2.Параметры.ЦельКомандировки6 = ТекстВставки;			
		ИначеЕсли К = 7 Тогда
			ВторойЛист2.Параметры.ЦельКомандировки7 = ТекстВставки;
		ИначеЕсли К = 8 Тогда
			ВторойЛист2.Параметры.ЦельКомандировки8 = ТекстВставки;
		КонецЕсли;
		
		НомерПервогоСимволаСтрокиПоиска = КоличествоСимволовВСтроке + НомерПервогоСимволаСтрокиПоиска;

		НомерПервогоСимволаСтроки = НомерПервогоСимволаСтроки + КоличествоСимволовВСтроке;
		
 	КонецЦикла;

	ВторойЛист2.Параметры.ВыдалЗаданиеДолжность = КомандИнфо.ВыдалЗадание.Должность;
	ВторойЛист2.Параметры.ВыдалЗадание = КомандИнфо.ВыдалЗадание.Наименование;
	ТаблДок.Вывести(ВторойЛист2);

	
Возврат ТаблДок;
	
КонецФункции

&НаСервере
Функция ПечатьКомандировкиДляОдногоНаСервере()
	НуднаяКомандировка = Элементы.Список.ВыделенныеСтроки;
	Для Каждого СтрКом Из НуднаяКомандировка Цикл
		СсылкаКоманди = СтрКом;
	КонецЦикла;

	ТаблДок = Новый ТабличныйДокумент;
	Макет = Документы.КомандировочноеУдостоверение.ПолучитьМакет("КомандировачныйЛистДляОдного");
	Лист1 = Макет.ПолучитьОбласть("Лист1");
	Лист2 = Макет.ПолучитьОбласть("Лист2");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомандировочноеУдостоверение.Ссылка КАК Ссылка,
		|	КомандировочноеУдостоверение.Номер КАК Номер,
		|	КомандировочноеУдостоверение.Дата КАК Дата,
		|	КомандировочноеУдостоверение.КудаКомандировать КАК КудаКомандировать,
		|	КомандировочноеУдостоверение.НачалоКомандировки КАК НачалоКомандировки,
		|	КомандировочноеУдостоверение.ОкончаниеКомандировки КАК ОкончаниеКомандировки,
		|	КомандировочноеУдостоверение.ЦельКомандировки КАК ЦельКомандировки,
		|	КомандировочноеУдостоверение.Подразделение КАК Подразделение,
		|	КомандировочноеУдостоверение.ВыдалЗадание КАК ВыдалЗадание,
		|	КомандировочноеУдостоверение.Составитель КАК Составитель,
		|	КомандировочноеУдостоверение.КоличествоДней КАК КоличествоДней,
		|	КомандировочноеУдостоверение.Руководитель КАК Руководитель,
		|	КомандировочноеУдостоверение.НомерПриказа КАК НомерПриказа,
		|	КомандировочноеУдостоверение.ДатаПриказа КАК ДатаПриказа
		|ИЗ
		|	Документ.КомандировочноеУдостоверение КАК КомандировочноеУдостоверение
		|ГДЕ
		|	КомандировочноеУдостоверение.Ссылка = &Ссылка";
	    Запрос.УстановитьПараметр("Ссылка", СсылкаКоманди);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	КомандИнфо = ВыборкаДетальныеЗаписи;
	КонецЕсли;
	
	Лист1.Параметры.НОМЕР = КомандИнфо.Номер;
	Лист1.Параметры.ДАТА = Формат(КомандИнфо.Дата,"ДФ=dd.MM.yyyy");
		
	Лист1.Параметры.КудаКомандировать = КомандИнфо.КудаКомандировать;
	Лист1.Параметры.КоДн = ПолучитьСклоненияСтрокиПоЧислу("день", КомандИнфо.КоличествоДней,,,"ПД=Именительный")[0];
	Лист1.Параметры.Д = Формат(КомандИнфо.НачалоКомандировки,"ДФ=дд");
	Лист1.Параметры.М = Сред(Формат(КомандИнфо.НачалоКомандировки,"ДФ=ддММММ"), 3);
	Лист1.Параметры.Г = Формат(КомандИнфо.НачалоКомандировки,"ДФ=гггг");

	
	Лист1.Параметры.НачалоКомандировки = Формат(КомандИнфо.НачалоКомандировки,"ДФ=dd.MM.yyyy");
	
	Лист1.Параметры.ОкончаниеКомандировки = Формат(КомандИнфо.ОкончаниеКомандировки,"ДФ=dd.MM.yyyy");
	
	
	Лист1.Параметры.НомерПриказа = КомандИнфо.НомерПриказа;
	Лист1.Параметры.ДатаПриказа = Формат(КомандИнфо.ДатаПриказа,"ДФ=dd.MM.yyyy");
	Лист1.Параметры.РуководительДолжность = КомандИнфо.Руководитель.Должность;
	Лист1.Параметры.Руководитель = КомандИнфо.Руководитель;
	
	Лист1.Параметры.СоставительДолжность = КомандИнфо.Составитель.Должность;
	Лист1.Параметры.Составитель = КомандИнфо.Составитель.ПолноеНаименование;
	Лист1.Параметры.Составитель0 = КомандИнфо.Составитель.Наименование;
	
	
	ТаблДок.Вывести(Лист1);
	
	ТаблДок.ВывестиГоризонтальныйРазделительСтраниц();
		

	ТекстДляВорд = Врег(Лев(КомандИнфо.ЦельКомандировки.ПолноеНаименование,1)) + Сред(КомандИнфо.ЦельКомандировки.ПолноеНаименование,2);
	
	КоличествоСимволов = 100;		
	НомерПервогоСимволаСтрокиПоиска = 100;
	НомерПервогоСимволаСтроки = 0;
	ДлинаВсейСтр = СтрДлина(ТекстДляВорд);

	Для К = 0 По 8 Цикл
	    ТекстДляВордРед = Сред(ТекстДляВорд, НомерПервогоСимволаСтроки, КоличествоСимволов);
		Кол = СтрДлина(ТекстДляВордРед);
		Если Кол = 100 Тогда
		КоличествоСимволовВСтроке = СтрНайти(ТекстДляВордРед, " ", НаправлениеПоиска.СКонца, Кол);
		Иначе
		КоличествоСимволовВСтроке = 100;
		КонецЕсли;
		Если Кол < КоличествоСимволов И Не КоличествоСимволовВСтроке = 0 Тогда 
			
			ТекстВставки = ТекстДляВордРед;
			
		Иначе
			
			ТекстВставки = Сред(ТекстДляВордРед, 0, КоличествоСимволовВСтроке);
			
		КонецЕсли;
		Если К = 0 Тогда
			Лист2.Параметры.ЦельКомандировки0 = ТекстВставки;
		ИначеЕсли К = 1 Тогда
			Лист2.Параметры.ЦельКомандировки1 = ТекстВставки;
		ИначеЕсли К = 2 Тогда
			Лист2.Параметры.ЦельКомандировки2 = ТекстВставки;
		ИначеЕсли К = 3 Тогда
			Лист2.Параметры.ЦельКомандировки3 = ТекстВставки;
		ИначеЕсли К = 4 Тогда
			Лист2.Параметры.ЦельКомандировки4 = ТекстВставки;			
		ИначеЕсли К = 5 Тогда
			Лист2.Параметры.ЦельКомандировки5 = ТекстВставки;			
		ИначеЕсли К = 6 Тогда
			Лист2.Параметры.ЦельКомандировки6 = ТекстВставки;			
		ИначеЕсли К = 7 Тогда
			Лист2.Параметры.ЦельКомандировки7 = ТекстВставки;
		ИначеЕсли К = 8 Тогда
			Лист2.Параметры.ЦельКомандировки8 = ТекстВставки;
		КонецЕсли;
		
		НомерПервогоСимволаСтрокиПоиска = КоличествоСимволовВСтроке + НомерПервогоСимволаСтрокиПоиска;

		НомерПервогоСимволаСтроки = НомерПервогоСимволаСтроки + КоличествоСимволовВСтроке;
		
 	КонецЦикла;

	Лист2.Параметры.ВыдалЗаданиеДолжность = КомандИнфо.ВыдалЗадание.Должность;
	Лист2.Параметры.ВыдалЗадание = КомандИнфо.ВыдалЗадание.Наименование;
	ТаблДок.Вывести(Лист2);

	
Возврат ТаблДок;
	
КонецФункции

&НаСервере
Функция ПечатьКомандировкиВПриказНаСервере()
	НуднаяКомандировка = Элементы.Список.ВыделенныеСтроки;
	Для Каждого СтрКом Из НуднаяКомандировка Цикл
		СсылкаКоманди = СтрКом;
	КонецЦикла;

	
	ТаблДок = Новый ТабличныйДокумент;
	Макет = Документы.КомандировочноеУдостоверение.ПолучитьМакет("МакетКомандировкиВПриказ");
	ЛистВПриказ = Макет.ПолучитьОбласть("ПолеВПриказ");
	ТекстСотрудник = "";
	ДолжностьДляУкорота = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомандировочноеУдостоверениеГруппаРаботников.ФИОполное.Должность.Наименование КАК ФИОполноеДолжностьНаименование,
		|	КомандировочноеУдостоверениеГруппаРаботников.ФИОполное.Наименование КАК ФИОполноеНаименование
		|ИЗ
		|	Документ.КомандировочноеУдостоверение.ГруппаРаботников КАК КомандировочноеУдостоверениеГруппаРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КомандировочноеУдостоверение КАК КомандировочноеУдостоверение
		|		ПО КомандировочноеУдостоверениеГруппаРаботников.Ссылка = КомандировочноеУдостоверение.Ссылка
		|ГДЕ
		|	КомандировочноеУдостоверение.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаКоманди);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если СтрНайти(ВыборкаДетальныеЗаписи.ФИОполноеДолжностьНаименование,"Водитель") Тогда
			ДолжностьДляУкорота = "Водитель";
		ИначеЕсли СтрДлина(ВыборкаДетальныеЗаписи.ФИОполноеДолжностьНаименование) > 35 Тогда
			
			ДлинаДолдностиКом = СтрНайти(ВыборкаДетальныеЗаписи.ФИОполноеДолжностьНаименование, " ", НаправлениеПоиска.СКонца, 35);
			
			ДолжностьДляУкорота = Сред(ВыборкаДетальныеЗаписи.ФИОполноеДолжностьНаименование, 0, ДлинаДолдностиКом);
			
		Иначе 
			
			ДолжностьДляУкорота = ВыборкаДетальныеЗаписи.ФИОполноеДолжностьНаименование;
			
		КонецЕсли;
		ТекстСотрудник = ТекстСотрудник + ДолжностьДляУкорота + " " +  ВыборкаДетальныеЗаписи.ФИОполноеНаименование+", ";
		
	КонецЦикла;

	ТекстДляВорд = Лев(ТекстСотрудник, СтрДлина(ТекстСотрудник)-2);
	
	КоличествоСимволов = 67;		
	НомерПервогоСимволаСтрокиПоиска = 90;
	НомерПервогоСимволаСтроки = 0;
	ДлинаВсейСтр = СтрДлина(ТекстДляВорд);

	Для К = 0 По 3 Цикл
		ТекстДляВордРед = Сред(ТекстДляВорд, НомерПервогоСимволаСтроки, КоличествоСимволов);
		
		Кол = СтрДлина(ТекстДляВордРед);
		Если Кол = КоличествоСимволов Тогда
			КоличествоСимволовВСтроке = СтрНайти(ТекстДляВордРед, " ", НаправлениеПоиска.СКонца, Кол);
		Иначе
			КоличествоСимволовВСтроке = 90;
		КонецЕсли;
		Если Кол < КоличествоСимволов И Не КоличествоСимволовВСтроке = 0 Тогда 
			
			ТекстВставки = ТекстДляВордРед;
			
		Иначе
			
			ТекстВставки = Сред(ТекстДляВордРед, 0, КоличествоСимволовВСтроке);
			
		КонецЕсли;
		
		
		Если К = 0 Тогда
			ЛистВПриказ.Параметры.ГРУППАКОМАН0 = ТекстВставки;
		ИначеЕсли К = 1 Тогда
			ЛистВПриказ.Параметры.ГРУППАКОМАН1 = ТекстВставки;
		ИначеЕсли К = 2 Тогда
			ЛистВПриказ.Параметры.ГРУППАКОМАН2= ТекстВставки;
		ИначеЕсли К = 3 Тогда
			ЛистВПриказ.Параметры.ГРУППАКОМАН3= ТекстВставки;
		КонецЕсли;
		
		НомерПервогоСимволаСтрокиПоиска = КоличествоСимволовВСтроке + НомерПервогоСимволаСтрокиПоиска;

		НомерПервогоСимволаСтроки = НомерПервогоСимволаСтроки + КоличествоСимволовВСтроке;
		КоличествоСимволов = 90;
 	КонецЦикла;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомандировочноеУдостоверение.КудаКомандировать КАК КудаКомандировать,
		|	КомандировочноеУдостоверение.НачалоКомандировки КАК НачалоКомандировки,
		|	КомандировочноеУдостоверение.ОкончаниеКомандировки КАК ОкончаниеКомандировки,
		|	КомандировочноеУдостоверение.КоличествоДней КАК КоличествоДней,
		|	КомандировочноеУдостоверение.ВыдалЗадание.Наименование КАК ВыдалЗаданиеНаименование,
		|	КомандировочноеУдостоверение.ВыдалЗадание.Должность.Наименование КАК ВыдалЗаданиеДолжностьНаименование,
		|	КомандировочноеУдостоверение.ЦельКомандировки КАК ЦельКомандировки
		|ИЗ
		|	Документ.КомандировочноеУдостоверение КАК КомандировочноеУдостоверение
		|ГДЕ
		|	КомандировочноеУдостоверение.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаКоманди);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИнфоДляЛистаВПриказ = ВыборкаДетальныеЗаписи;
	КонецЦикла;
	
	
	ЛистВПриказ.Параметры.МЕСТИОРГ = ИнфоДляЛистаВПриказ.КудаКомандировать;
	ЛистВПриказ.Параметры.ДНЕЙКОМА = ПолучитьСклоненияСтрокиПоЧислу("день", ИнфоДляЛистаВПриказ.КоличествоДней,,,"ПД=Именительный")[0];
	ЛистВПриказ.Параметры.НАЧАЛКОМА = Формат(ИнфоДляЛистаВПриказ.НачалоКомандировки,"ДФ=dd.MM.yyyy");
	ЛистВПриказ.Параметры.ОКОНКОМА = Формат(ИнфоДляЛистаВПриказ.ОкончаниеКомандировки,"ДФ=dd.MM.yyyy"); 	
	ЛистВПриказ.Параметры.ФИОНАЧАЛЬНИ = ИнфоДляЛистаВПриказ.ВыдалЗаданиеНаименование;
	ЛистВПриказ.Параметры.ДОЛЖНОСТЬНАЧАЛЬНИ = ИнфоДляЛистаВПриказ.ВыдалЗаданиеДолжностьНаименование;	
	
	ТекстДляВорд = Врег(Лев(ИнфоДляЛистаВПриказ.ЦельКомандировки,1)) + Сред(ИнфоДляЛистаВПриказ.ЦельКомандировки,2);
	
	КоличествоСимволов = 57;		
	НомерПервогоСимволаСтрокиПоиска = 90;
	НомерПервогоСимволаСтроки = 0;
	ДлинаВсейСтр = СтрДлина(ТекстДляВорд);

	Для К = 0 По 3 Цикл
		ТекстДляВордРед = Сред(ТекстДляВорд, НомерПервогоСимволаСтроки, КоличествоСимволов);
		Кол = СтрДлина(ТекстДляВордРед);
		Если Кол = КоличествоСимволов Тогда
			КоличествоСимволовВСтроке = СтрНайти(ТекстДляВордРед, " ", НаправлениеПоиска.СКонца, Кол);
		Иначе
			КоличествоСимволовВСтроке = 90;
		КонецЕсли;
		Если Кол < КоличествоСимволов И Не КоличествоСимволовВСтроке = 0 Тогда 
			
			ТекстВставки = ТекстДляВордРед;
			
		Иначе
			
			ТекстВставки = Сред(ТекстДляВордРед, 0, КоличествоСимволовВСтроке);
			
		КонецЕсли;
		
		
		Если К = 0 Тогда
			ЛистВПриказ.Параметры.ЦЕЛЬ0 = ТекстВставки;
		ИначеЕсли К = 1 Тогда
			ЛистВПриказ.Параметры.ЦЕЛЬ1 = ТекстВставки;
		ИначеЕсли К = 2 Тогда
			ЛистВПриказ.Параметры.ЦЕЛЬ2 = ТекстВставки;
		ИначеЕсли К = 3 Тогда
			ЛистВПриказ.Параметры.ЦЕЛЬ3 = ТекстВставки;
		КонецЕсли;
		
		НомерПервогоСимволаСтрокиПоиска = КоличествоСимволовВСтроке + НомерПервогоСимволаСтрокиПоиска;

		НомерПервогоСимволаСтроки = НомерПервогоСимволаСтроки + КоличествоСимволовВСтроке;
		КоличествоСимволов = 90;
 	КонецЦикла;
	
	
	ТаблДок.Вывести(ЛистВПриказ);	
	Возврат ТаблДок;	
КонецФункции

&НаСервере
Функция ПолучитьКлиентПользователя(ИмяПриложения)
	НомерСоединения  = НомерСоединенияИнформационнойБазы();
	
	СеансыИБ = ПолучитьСеансыИнформационнойБазы();        
    Для Каждого Сеанс Из СеансыИБ Цикл         
        Если Сеанс.НомерСоединения = НомерСоединения Тогда
				ИмяПриложения = ПредставлениеПриложения(Сеанс.ИмяПриложения); 
        КонецЕсли;   
    КонецЦикла;
	Возврат ИмяПриложения;
КонецФункции
